#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan for eks</summary>

```hcl
terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
eks relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/bestation-demo-infrastructure/bestation-demo-infrastructure/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/bestation-demo-infrastructure/bestation-demo-infrastructure

To view this run in a browser, visit:
https://app.terraform.io/app/haiktpm/bestation-demo-infrastructure/runs/run-Bf5UNneNMnrQE8fJ

Waiting for the plan to start...

Terraform v1.14.3
on linux_amd64
Initializing plugins and modules...
data.aws_vpcs.vpcs: Refreshing...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Refreshing...
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Refreshing...
module.eks.module.kms.data.aws_caller_identity.current[0]: Refreshing...
module.eks.data.aws_partition.current[0]: Refreshing...
module.eks.data.aws_caller_identity.current[0]: Refreshing...
module.eks.module.kms.data.aws_partition.current[0]: Refreshing...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Refresh complete after 0s [id=2830595799]
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Refresh complete after 0s [id=2560088296]
module.eks.module.kms.data.aws_partition.current[0]: Refresh complete after 0s [id=aws]
module.eks.data.aws_partition.current[0]: Refresh complete after 0s [id=aws]
module.eks.module.kms.data.aws_caller_identity.current[0]: Refresh complete after 0s [id=065140405948]
module.eks.data.aws_caller_identity.current[0]: Refresh complete after 0s [id=065140405948]
module.eks.data.aws_iam_session_context.current[0]: Refreshing...
module.eks.data.aws_iam_session_context.current[0]: Refresh complete after 0s [id=arn:aws:iam::065140405948:user/haitv]
data.aws_vpcs.vpcs: Refresh complete after 1s [id=ap-southeast-1]
data.aws_subnets.private: Refreshing...
data.aws_subnets.all_subnet: Refreshing...
data.aws_subnets.all_subnet: Refresh complete after 0s [id=ap-southeast-1]
module.eks.module.eks_managed_node_group["default"].data.aws_ssm_parameter.ami[0]: Refreshing...
data.aws_subnets.private: Refresh complete after 0s [id=ap-southeast-1]
module.eks.module.eks_managed_node_group["default"].data.aws_ssm_parameter.ami[0]: Refresh complete after 1s [id=/aws/service/eks/optimized-ami/1.33/amazon-linux-2023/x86_64/standard/recommended/release_version]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_ecr_repository.bestarion-demo-ecr will be created
  + resource "aws_ecr_repository" "bestarion-demo-ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "bestarion-demo-ecr"
      + region               = "ap-southeast-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + tags_all             = {
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.33"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.33"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.33"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/eks/bestarion-demo/cluster"
      + name_prefix                 = (known after apply)
      + region                      = "ap-southeast-1"
      + retention_in_days           = 90
      + skip_destroy                = false
      + tags                        = {
          + "Name"    = "/aws/eks/bestarion-demo/cluster"
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + tags_all                    = {
          + "Name"    = "/aws/eks/bestarion-demo/cluster"
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["cost"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "cost"
      + region      = "ap-southeast-1"
      + resource_id = (known after apply)
      + value       = "bestarion-demo"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["creator"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "creator"
      + region      = "ap-southeast-1"
      + resource_id = (known after apply)
      + value       = "bestarion-demo"
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "coredns"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "ap-southeast-1"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + tags_all                    = {
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "kube-proxy"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "ap-southeast-1"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + tags_all                    = {
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "ap-southeast-1"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + tags_all                    = {
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = false
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + deletion_protection           = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "bestarion-demo"
      + platform_version              = (known after apply)
      + region                        = "ap-southeast-1"
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + tags_all                      = {
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + version                       = "1.33"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = false
        }

      + compute_config (known after apply)

      + control_plane_scaling_config (known after apply)

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)

          + elastic_load_balancing (known after apply)
        }

      + storage_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-03c9f67e9f218d8f9",
              + "subnet-073acc9e4f19b022f",
              + "subnet-0c799f4799c02f5bb",
              + "subnet-0f8af80dad9923799",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name"    = "bestarion-demo-eks-irsa"
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + tags_all        = {
          + "Name"    = "bestarion-demo-eks-irsa"
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_policy.cluster_encryption[0] will be created
  + resource "aws_iam_policy" "cluster_encryption" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Cluster encryption policy to allow cluster role to utilize CMK provided"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "bestarion-demo-cluster-ClusterEncryption"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + tags_all         = {
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
    }

  # module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "bestarion-demo-cluster-"
      + path                  = "/"
      + tags                  = {
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + tags_all              = {
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "bestarion-demo-cluster-"
      + owner_id               = (known after apply)
      + region                 = "ap-southeast-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "bestarion-demo-cluster"
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + tags_all               = {
          + "Name"    = "bestarion-demo-cluster"
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + vpc_id                 = "vpc-03689b421957c8ce0"
    }

  # module.eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "bestarion-demo-node-"
      + owner_id               = (known after apply)
      + region                 = "ap-southeast-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                                 = "bestarion-demo-node"
          + "cost"                                 = "bestarion-demo"
          + "creator"                              = "bestarion-demo"
          + "kubernetes.io/cluster/bestarion-demo" = "owned"
        }
      + tags_all               = {
          + "Name"                                 = "bestarion-demo-node"
          + "cost"                                 = "bestarion-demo"
          + "creator"                              = "bestarion-demo"
          + "kubernetes.io/cluster/bestarion-demo" = "owned"
        }
      + vpc_id                 = "vpc-03689b421957c8ce0"
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["egress_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + region                   = "ap-southeast-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_10251_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 10251/tcp webhook"
      + from_port                = 10251
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10251
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 4443/tcp webhook"
      + from_port                = 4443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 6443/tcp webhook"
      + from_port                = 6443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 8443/tcp webhook"
      + from_port                = 8443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 9443/tcp webhook"
      + from_port                = 9443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node ingress on ephemeral ports"
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "ap-southeast-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS UDP"
      + from_port                = 53
      + id                       = (known after apply)
      + protocol                 = "udp"
      + region                   = "ap-southeast-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.time_sleep.this[0] will be created
  + resource "time_sleep" "this" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "certificate_authority_data" = (known after apply)
          + "endpoint"                   = (known after apply)
          + "kubernetes_version"         = "1.33"
          + "name"                       = (known after apply)
          + "service_cidr"               = (known after apply)
        }
    }

  # module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2023_x86_64_STANDARD"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = (known after apply)
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "m5.large",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "default-"
      + node_role_arn          = (known after apply)
      + region                 = "ap-southeast-1"
      + release_version        = "1.33.5-20260120"
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-03c9f67e9f218d8f9",
          + "subnet-073acc9e4f19b022f",
          + "subnet-0c799f4799c02f5bb",
          + "subnet-0f8af80dad9923799",
        ]
      + tags                   = {
          + "Name"    = "default"
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + tags_all               = {
          + "Name"    = "default"
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + version                = "1.33"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "default-eks-node-group-"
      + path                  = "/"
      + tags                  = {
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + tags_all              = {
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for default EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "default-"
      + region                 = "ap-southeast-1"
      + tags                   = {
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + tags_all               = {
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)
        # (2 unchanged attributes hidden)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"    = "default"
              + "cost"    = "bestarion-demo"
              + "creator" = "bestarion-demo"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name"    = "default"
              + "cost"    = "bestarion-demo"
              + "creator" = "bestarion-demo"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name"    = "default"
              + "cost"    = "bestarion-demo"
              + "creator" = "bestarion-demo"
            }
        }
    }

  # module.eks.module.kms.data.aws_iam_policy_document.this[0] will be read during apply
 <= data "aws_iam_policy_document" "this" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + minified_json             = (known after apply)
      + override_policy_documents = []
      + source_policy_documents   = []

      + statement {
          + actions   = [
              + "kms:*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "Default"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::065140405948:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:CancelKeyDeletion",
              + "kms:Create*",
              + "kms:Delete*",
              + "kms:Describe*",
              + "kms:Disable*",
              + "kms:Enable*",
              + "kms:Get*",
              + "kms:ImportKeyMaterial",
              + "kms:List*",
              + "kms:Put*",
              + "kms:ReplicateKey",
              + "kms:Revoke*",
              + "kms:ScheduleKeyDeletion",
              + "kms:TagResource",
              + "kms:UntagResource",
              + "kms:Update*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyAdministration"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::065140405948:user/haitv",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyUsage"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.eks.module.kms.aws_kms_alias.this["cluster"] will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/eks/bestarion-demo"
      + name_prefix    = (known after apply)
      + region         = "ap-southeast-1"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "bestarion-demo cluster encryption key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = false
      + policy                             = (known after apply)
      + region                             = "ap-southeast-1"
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
      + tags_all                           = {
          + "cost"    = "bestarion-demo"
          + "creator" = "bestarion-demo"
        }
    }

  # module.eks.module.eks_managed_node_group["default"].module.user_data.null_resource.validate_cluster_service_cidr will be created
  + resource "null_resource" "validate_cluster_service_cidr" {
      + id = (known after apply)
    }

Plan: 37 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_endpoint = (known after apply)
  + ecr_repo         = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @haiktpm, Action: `pull_request`, Working Directory: `eks`, Workflow: `Terraform`*